Repository: 12masta/MyWebsite
Catalog: src/MyPortfolio/Resources/Controllers/HomeController.*.resx
Languages: pl

source: About
pl: O mnie

source: ABOUT ME
pl: O MNIE

# aboutMeDesc1
source: Hello, I am Marcin Stanek and I am test automation engineer. I am passionate about designing Automation Frameworks that are effective and easy to maintain. My weapons against websites are Selenium WebDriver, C# and Java.
pl: Cześć, jestem Marcin Stanek i jestem inżynierem kontroli jakości oprogramowania. Pasjonuje mnie tworzenie i projekotwanie efektywnych, łatwych w zarządzaniu bibliotek automatyzujących testy. Moja broń przeciw interetowym aplikacjom to Selenium WebDriver, C# i Java.

# aboutMeDesc2
source: Excepts software testing I am also developer, I am able to create for you web or desktop application. I live in Cracow with my wife and lovely daughter. I am interested in taking a job where I can use my skills and at the same time enable me to further develop the intellectual and personal knowledge.
pl: Oprócz testowania oprogramowania zajmuje się również programowaniem. Jestem w stanie stworzyć dla Ciebie stronę internetową lub aplikacje na komputer lub smartfon. Jestem absolwentem Politechniki Krakowskiej. Mieszkam w Krakowie z żoną i uroczą córką. Jestem zainteresowany podjęciem pracy w której będę mógł używać swoich umiejętnośći oraz umożliwi mi dalszy rozwój intelektualny i osobisty.

source: Contact
pl: Kontakt

source: CONTACT WITH ME
pl: SKONTAKTUJ SIĘ ZE MNĄ

# contactWithMe2
source: CONTACT WITH ME
pl: KONTAKT

# contactWithMe2Desc
source: Send me a message. I will reply in the near future.
pl: Wyślij mi wiadomość. Odpowiem najszybciej jak to tylko możliwe.

source: Deliver on time
pl: Dostarczam na czas

# deliverOnTimeDesc
source: I work hard to make sure all services are delivered on time but without compromising quality.
pl: Cieżko pracuje aby zapewnić dostarczanie serwisów na czas, bez kompromisów w dziedzinie jakośći.

source: DEVELOPER
pl: DEVELOPEREM

source: ENGINEER
pl: INŻYNIEREM

source: FATHER
pl: OJCEM

source: FIND ME
pl: Znajdź mnie

# findMeDesc
source: Want to meet? Talk about projects? You cand find me here, but please, write message first
pl: Chcesz się spotkać? Porozmawiać o projektach? Możesz mnie znaleźć tutaj, jednak proszę, napisz najpierw wiadomość.

# footerButton
source: Save
pl: Zapisz

# footerLanguage
source: Language
pl: Język

# gitHubDesc
source: My code repository
pl: Moje repozytorium kodu

source: Home
pl: Strona główna

source: Keep You Updated
pl: Informacje na bieżąco

# keepYouUpdatedDesc
source: I keep clients informed every step of the way. No surprises. Simply peace of mind.
pl: Moi klienci są informowani na każdym etapie procesu produkcji oprogramowania. Bez niespodzianek. Prosty punkt widzenia.

# latestWoks
source: LATEST WORKS
pl: MOJE OSTANIE PROJEKTY

# mail
source: contact@marcinstanek.pl
pl: kontakt@marcinstanek.pl

source: Message
pl: Wiadomość

source: Mobility
pl: Mobilność

# mobilityDesc
source: You will have absolutely no problem to showcase your company website to your cleints and friends, whatever you actually are.
pl: Nie będziesz miał żadnego problemu aby zaprezentować stronę Twojej firmy klientom lub przyjaciołom gdziekolwiek właśnie jesteś.

source: OFFER FROM ME
pl: MOJA OFERTA

# place1
source: Cracow, Poland
pl: Kraków, Polska

# place2
source: Wolica, Poland
pl: Wolica, Polska

# qaDesc
source: Looking for QA? Need to automate testing process in your company? You got problem with qualtiy of software in your organization? You've come to the right place to solve these problems!
pl: Poszukujesz kontrolera jakości? Potrzebujesz zautomatyzować procesy testowe w Twojej firmie? Masz problem z jakością kodu w Twojej organizacji? Trafiłeś w dobre miejsce aby rozwiązać te problemy!

# qAToolsDesc
source: Desktop application which help me with daily work
pl: Aplikacja która pomoga mi w codziennej pracy

# sendMessageButton
source: Send Message
pl: Wyślij wiadomość

# sliderDescription
source: WITH 2 YEARS WORK EXPERIENCE. PROFESSIONALLY SOFTWARE QA ENGINEER, PRIVATE DEVELOPER AND IT PASSIONATE. THIS SITE SHOWCASES SOME OF MY WORK.
pl: Z DWOMA LATAMI KOMERCYJNEGO DOŚWIADCZENIA. ZAWODOWO INŻYNIER KONTROLI JAKOŚCI OPROGRAMOWANIA, PRYWATNIE DEWELOPER I PASJONAT IT. TA STRONA JEST POKAZEM MOICH UMIEJĘTNOŚCI

# sliderHi
source: HI, MY NAME IS MARCIN. I AM A
pl: CZEŚĆ, MAM NA IMIE MARCIN. JESTEM

# sofwareQa
source: SOFTWARE QA
pl: TESTEREM OPROGRAMOWANIA

source: SO WHAT YOU THINK ?
pl: A WIĘC CO MYŚLISZ?

source: Subject
pl: Temat

# testDrivenDevelopmentDesc
source: Using testing tools and processes, automate, load, database and mobile device testing, ensuring the final product is defects free and meets quality standards.
pl: Używam nowoczesnych narzędzi oraz procesów. Przeprowadzam testy automatyczne , obciążeniowe, bazy danych i mobilne aby zapewnić że produkt jest wolny od błedów i spełnia standardy jakości.

source: Thesis Engineering
pl: Praca inżynierska

# thesisEngineeringDesc
source: System for supporting rowing section
pl: System wspierający zarządzanie sekcją wioślarską

# viewWorkButton
source: VIEW WORKS
pl: ZOBACZ MOJE PROJEKTY

source: Web Developing
pl: Tworzenie stron

# webDevelopingDesc
source: Your business is unique. Your website should be too. Approaches each client individually, custom-tailoring web services to address your unique demands.
pl: Twój biznes jest unikatowy. Twoja strona internetowa również powinna taka być. Indywidualne podejsćie, skrojone na wymiar serwisy internetowe aby sprostać Twoim unikatowym wymaganiom.

source: Your Email
pl: Twój email

source: Your Name
pl: Twoje imie
